// ================================Chapter1 항목입니다.============================================== // 
// // fn main() {} 이 부분은 프로그램의 진입점이다.
// Chapter 1. HelloWorld
// fn main() {
//     // 여기서 println!() 은 매크로다,(매크로로는 !를 사용해 호출)

//     // println! 은 콜솔에 출력하느 함수 (줄바꿈) (print!는 줄바꿈 X)
//     // println!("와 샌즈!");  // ; 러스트에서 필요할 수 도 아닐 수도 있다. 기본적으로 사용하자
//     //    let x = 10;
//     //    println!("{}", x)

// }

// ================================Chapter1 항목입니다.============================================== // 


// ================================Chapter2 항목입니다.============================================== // 
// // Chapter 2. 변수 
//  // 변수 x 에 10을 할당하고, x 값을 출력하는 코드 
// //  let x = 10;
// //  println!("{}", x)

// //  println!("===============================================")
//  // 다음 예제는 x의 값을 20으로 바꾸는 평볌한 코드이다.
//  fn main() {
//      // 정상적으로 출력될 것 같지만, 오류가 나온다.
//      // 그 이유는 변수 x는 불변이기 떄문에 다른 값으로 바꿀 수 없다.
//      // 그럴 떄는 mut 키워드를 사용해준다.
//     // let x = 10; // X
//     let mut x = 10; // O
//     println!("{}", x);
//     println!("===============================================");
//     x = 20;
//     println!("{}", x);
//     println!("===============================================");
 

//     // 또한, 러스트에서는 변수를 덮을 수 있다.
//     let x = 10;
//     println!("{}",x);
//     println!("===============================================");
//     let x = 20;
//     println!("{}", x);

// }

/* 추가) 값의 타입
   
   타입을 정하고 싶다면, let 변수 이름: 타입 = 값; 으로 정하면 된다.
   
*/ 

// ================================Chapter2 항목입니다.============================================== // 

// ================================Chapter3 항목입니다.============================================== // 

// ================================Chapter3 항목입니다.============================================== // 

